// 全部地区分类json-------------------------------------------------------------------------------------------
var chinaCity = [
    {
        letter:'A',
        city:['阿坝州','鞍山市','阿拉尔市','阿克苏地区','安庆市','安顺市','阿勒泰地区','阿拉善盟','阿里地区','安康市','安阳市']
    },
    {
        letter:'B',
        city:['北京市','滨州市','本溪市','蚌埠市','白沙县','保亭县','毕节市','巴音郭楞州','亳州市','白山市','博尔塔拉州','白城市','保定市','北海市','保山市','百色市','包头市','宝鸡市','巴彦淖尔市','白银市','巴中市']
    },
    {
        letter:'C',
        city:['长治市','重庆','郴州市','昌都地区','崇左市','澄迈县','朝阳市','昌江县','长春市','滁州市','昌吉州','潮州市','池州市','承德市','沧州市','楚雄州','赤峰市','成都市','长沙市','常州市','常德市']
    },
    {
        letter:'D',
        city:['东营市','定西市','迪庆州','德州市','大连市','丹东市','东方市','东莞市','定安县','大庆市','大兴安岭地区','大理州','大同市','德宏州','德阳市','儋州市','达州市']
    },
    {
        letter:'E',
        city:['鄂尔多斯市','恩施州鄂州市']
    },
    {
        letter:'F',
        city:['抚顺市','阜新市','佛山市','阜阳市','防城港市','福州市','抚州市']
    },
    {
        letter:'G',
        city:['甘南州','甘孜州','果洛州','广州市','固原市','贵阳市','桂林市','贵港市','赣州市','广元市','广安市']
    },
    {
        letter:'H',
        city:['海东地区','海北州','黄南州','怀化市','海南州','海西州','海口市','菏泽市','河源市','合肥市','葫芦岛市','淮南市','淮北市','哈密地区','和田地区','惠州市','黄山市','邯郸市','哈尔滨市','杭州市','鹤岗市','湖州市','贺州市','黑河市','红河州衡水市','河池市','呼和浩特市','呼伦贝尔市','黄石市','汉中市','淮安市','黄冈市','鹤壁市','衡阳市']
    },
    {
        letter:'J',
        city:['锦州市','江门市','吉林市','揭阳市','嘉兴市','济源市','鸡西市','金华市','佳木斯市','景德镇市','九江市','晋城市','晋中市','济宁市','吉安市','荆州市','金昌市','焦作市','荆门市','嘉峪关市','济南市','酒泉市']
    },
    {
        letter:'K',
        city:['克拉玛依市','喀什地区','克孜勒苏柯尔克孜自治州','昆明市','开封市']
    },
    {
        letter:'L',
        city:['临夏州','莱芜市','临沂市','娄底市','凉山','聊城市','六盘水市','辽阳市','临高县','陵水县','乐东县','六安市','柳,市','临沧市','丽水市','丽江市','廊坊市','龙岩市','吕梁市','临汾市','林芝地区','拉萨市','连云港市','泸,市','洛阳市','辽源市','兰市','乐山市','来宾市','陇南市','漯河市']
    },
    {
        letter:'M',
        city:['眉山市','梅市','马鞍山市','茂名市','牡丹江市','绵阳市']
    },
    {
        letter:' N',
        city:['那曲地区','宁波市','南宁市','南昌市','怒江','南平市','宁德市','南京市','内江市','南通市','南充市','南阳市']
    },
    {
        letter:'P',
        city:['盘锦市','普洱市','萍乡市','莆田市','攀枝花市','平顶山市','平凉市','濮阳市']
    },
    {
        letter:'Q',
        city:['琼海市','琼中县','黔西南州','黔东南州','清远市','黔南州','曲靖市','齐齐哈尔市','钦州市','秦皇岛市','衢州市','七台河市','泉州市','潜江市','庆阳市','青岛市']
    },
    {
        letter:'R',
        city:['日喀则地区','日照市']
    },
    {
        letter:'S',
        city:['上海市','商丘市','沈阳市','山南地区','深圳市','石嘴山市','汕头市','韶关市','神农架林区','石河子市','三亚市','汕尾市','三沙市','四平市','石家庄市','宿州市','松原市','双鸭山市','绍兴市','绥化市','厦门市','三明市','上饶市','朔州市','十堰市','商洛市','宿迁市','遂宁市','随州市','苏州市','邵阳市','三门峡市']
    },
    {
        letter:'T',
        city:['天津','图木舒克市','泰安市','铜陵市','吐鲁番地区屯昌县','铜仁市','通化市','塔城地区','铁岭市','唐山市','台州市','太原市','铜川市','通辽市','天门市','泰州市','天水市']
    },
    {
        letter:'W',
        city:['潍坊市','五家渠市','威海市','万宁市','吴忠市','乌鲁木齐市','芜湖市','文昌市','五指山市','梧州市','温州市','文山州','乌海市','乌兰察布市','武汉市','渭南市','无锡市','武威市']
    },
    {
        letter:'X',
        city:['西宁市','信阳市','湘西州','邢台市','西双版纳州','新余市','锡林郭勒盟','西安市','忻州市','咸阳市','襄阳市','兴安盟','徐州市','孝感市','宣城市','仙桃市','咸宁市','新乡市','湘潭市','许昌市']
    },
    {
        letter:'Y',
        city:['烟台市','益阳市','永州市','玉树州','银川市','营口市','阳江市','云浮市','伊犁州延边州','玉溪市','玉林市','伊春市','阳泉市','鹰潭市','宜春市','延安市','宜昌市','运城市','榆林市','盐城市','扬州市','宜宾市','岳阳市','雅安市']
    },
    {
        letter:'Z',
        city:['张家界市','周口市','资阳市','驻马店市','珠海市','遵义市','中山市','湛江市','肇庆市','昭通市','张家口市','舟山市','漳州市','自贡市','郑州市','镇江市','株洲市','张掖市','淄博市','枣庄市','中卫市']
    }
]


// 菜单栏分类商品json-------------------------------------------------------------------------------------------
var menu = [
    {
        title:'<a  href="#">全球进口</a>',
        data:['乳品生鲜', '饼干糕点','酒水饮料','休闲零食','糖果巧克力','粮油调味','咖啡冲饮','麦片冲饮','母婴玩具','美妆个护','家居清洁']
    },
    {
        title:'<a  href="#">食品</a> / <a  href="#">酒</a> / <a  href="#">生鲜</a>',
        data:['饮料','酒类','休闲零食','粮油干货','厨房调料','饼干糕点','牛奶乳品','茶冲咖啡','肉蛋海鲜','新鲜蔬果','方便速食','乳品速食']
    },
    {
        title:'<a  href="#">母婴</a> / <a  href="#">玩具</a> / <a  href="#">童装</a>',
        data:['奶粉','营养辅食','尿裤湿巾','洗护用品','喂养用品','妈妈专区','寝具服饰','童车童床','玩具','乐器','童装/童鞋'] 
    },
    {
        title:'<a  href="#">纸巾</a> / <a  href="#">厨卫清洁</a> / <a  href="#">宠物</a>',
        data:['纸品湿巾','衣物清洁','家庭清洁','清洁用具','驱虫除湿','皮具护理','宠物生活','绿植园艺']
    },
    {
        title:'<a  href="#">家居家纺</a> / <a  href="#">厨具</a> / <a  href="#">家具</a>',
        data:['床上用品','生活日用','锅具水具','厨具刀具','茶具餐具','家装软饰','品质家具','家装建材']
    },
    {
        title:'<a  href="#">美妆</a> / <a  href="#">个人清洁</a>',
        data:['美发护发','女性护理','沐浴清洁','口腔护理','面部护理','缤纷彩妆','身体护理','男士护理','美容工具']
    },
    {
        title:'<a  href="#">女装</a> / <a  href="#">男装</a> / <a  href="#">内衣</a> / <a  href="#">珠宝</a>',
        data:['时尚裙装','女士上衣','女士裤子','品质内衣','型格男装','珠宝首饰','钟表/眼镜']
    },
    {
        title:'<a  href="#">鞋靴</a> / <a  href="#">箱包</a> / <a  href="#">运动户外</a>',
        data:['时尚女鞋','潮流女包','奢侈大牌','功能箱包','品质男鞋','精品男包','运动鞋服','健身器材','户外装备']
    },
    {
        title:'<a  href="#">手机</a> / <a  href="#">数码</a> / <a  href="#">电脑办公</a>',
        data:['手机','手机配件','摄影影像','影音电教','智能设备','数码配件','电脑整机','网络外设','办公设备']
    },
    {
        title:'<a  href="#">家用电器</a> / <a  href="#">汽车用品</a>',
        data:['厨房小电','生活电器','个护健康','电视空调','厨卫大电','冰箱','洗衣机','维修保养','汽车装饰','车载产品']
    },
    {
        title:'<a  href="#">医药/保健滋补/成人</a>',
        data:['营养健康','营养成分','传统滋补','成人用品','家用器械','隐形眼镜']
    },
    {
        title:'<a  href="#">图书</a>',
        data:['少儿','教育','文艺','经管励志','人文社科','生活','科技','技刊/原版','音像']
    }
]

// 搜索框提示文字--------------------------------------------------------------------------------------------------------
var random_arr = ['进口牛奶','蓝绘大宽面','飞利浦','吴大嫂','周黑鸭','皇家','李锦记','美容仪','斑马牌','气泡水','成人奶粉','曲奇夹心饼干','多趣酷思','湾仔码头','glasslock','净水器'];





